const poetry = (verse) => {
  const firstLetter = verse.charAt(verse.length - 1);
  const dataBase = [
    { ا:" اي خوش از تن کوچ کردن، خانه در جان داشتن  روی مانند پری از خلق پنهان داشتن"},
    { ب: "بسر برشو این گنبد آبگون را  بهم بشکن این طبل خالی میانرا"},
    { د: "دلت هرگز نمی گشت اینچنین آلوده و تیره  اگر چشم تو می‌دانست شرط پاسبانی را"},
    { ن: "نباید تاخت بر بیچارگان روز توانائی  بخاطر داشت باید روزگار ناتوانی را"},
    { ه: "هجوم فتنه‌هاي‌ آسمانی  مرا آموخت علم زندگانی"},
    { ت: "تو توانا شدي ایدوست که باری بکشی  نه که بر دوش گرانبار نهی باری چند"},
    { ر: "رام تو نمی شود زمانه  رام از چه شدي، رمیدن آموز"},
    { ز: "زان به تاریکی گذاری بنده را  تا ببیند ان رخ تابنده را"},
    { م: "مهر بلند، چهره ز خاور نمی نمود  ماه از حصار چرخ، سر باختر نداشت"},
    { خ: "خوش ان رمزی که عشقی را نوید است  خوش ان دل کاندران نور امید است"},
  ];

  dataBase.forEach((item) => {
    if (item.firstLetter) {
      const response = item.firstLetter;
    } 
  })
  if (!response) response = null;
  return response
};

export default poetry;